const NGWords = [
    "馬鹿",
    "死ね",
    "間抜け",
    "まぬけ",
    "ボケ",
    "変態",
    "屑",
    "クソ", "糞",
    "バカ", "アホ", "マヌケ", "トンマ", "腑抜け", "ボンクラ", "スカタン", "たわけ", "ノールス", "アンポンタン", "ウスラトンカチ", "出来損ない", "アンニャモンニャ", "タコ", "単細胞", "オタンコナス", "スットコドッコイ",

    "おっちょこちょい", "ちゃらんぽらん", "ドジ", "浅薄", "嘘つき", "卑怯者", "偽善者", "目立ちたがり", "いけず", "ぐず", "のろま", "ズル", "野次馬", "腰抜け", "ええかっこしい", "ものぐさ", "自堕落", "ふしだら", "無礼者", "横着", "厚かましい", "えげつない", "ふてぶてしい", "毒舌", "インチキ", "ぐうたら", "へなちょこ", "意気地なし", "恥知らず", "わからず屋", "唐変木", "朴念仁", "けち", "しぶちん", "しみったれ", "見栄っ張り", "エゴイスト", "ホラ吹き", "へそ曲がり", "石頭",

    "古狸", "狸親父", "女狐", "泥棒猫", "負け犬", "冷血", "極道", "畜生", "人非人", "人でなし", "鬼", "鬼畜", "極悪", "悪代官",
    "ゴミ"


]

$("*")
    .each(function (_, _) {
        var txt = $(this).html();
        $(this).html(
            replaceAllNGWords(txt)
        );
    })

function replaceAllNGWords(txt) {
    for (let index = 0; index < NGWords.length; index++) {
        const element = NGWords[index];
        console.log(txt)
        txt = txt.replace(new RegExp(element, "g"), "＊".repeat(element.length))
    }
    return txt
}